OpenNuvoton/NUC970_NonOS_BSP/Library/USB_HOST/src_core/support.c
/**************************************************************************//**
 * @file     support.c
 * @version  V1.10
 * $Revision: 2 $
 * $Date: 15/05/18 3:55p $
 * @brief  Functions to support USB host driver.
 *
 * @note
 * Copyright (C) 2015 Nuvoton Technology Corp. All rights reserved.
*****************************************************************************/

#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include "nuc970.h"
#include "sys.h"

#include "usb.h"

/// @cond HIDDEN_SYMBOLS

#define USB_MEM_ALLOC_MAGIC     0x19685788    /* magic number in leading block */

typedef struct USB_mhdr 
{
	UINT32  flag;  /* 0:free, 1:allocated, 0x3:first block */
	UINT32  bcnt;  /* if allocated, the block count of allocated memory block */
	UINT32  magic;
	UINT32  reserved;
}  USB_MHDR_T;

__align(USB_MEM_BLOCK_SIZE) UINT8  _USBMemoryPool[USB_MEMORY_POOL_SIZE];

static USB_MHDR_T  *_pCurrent;
static UINT32  _FreeMemorySize;
UINT32  _AllocatedMemorySize;   
UINT32  *_USB_pCurrent = (UINT32 *)&_pCurrent; 

static UINT32  _MemoryPoolBase, _MemoryPoolEnd;  

extern INT    _IsInUsbInterrupt;


void  USB_InitializeMemoryPool()
{
	//sysSetCachePages((UINT32)_USBMemoryPool, USB_MEMORY_POOL_SIZE, CACHE_DISABLE);
	//sysFlushCache(D_CACHE);
	_MemoryPoolBase = (UINT32)&_USBMemoryPool[0] | NON_CACHE_MASK;
	//_MemoryPoolBase = (UINT32)&_USBMemoryPool[0];

	_MemoryPoolEnd = _MemoryPoolBase + USB_MEMORY_POOL_SIZE;
	_FreeMemorySize = _MemoryPoolEnd - _MemoryPoolBase;
	_AllocatedMemorySize = 0;
	_pCurrent = (USB_MHDR_T *)_MemoryPoolBase;
	memset((CHAR *)_MemoryPoolBase, 0, _FreeMemorySize);
	//while (1);
}
	

INT32  USB_available_memory()
{
	return _FreeMemorySize;
}


INT32  USB_allocated_memory()
{
	return _AllocatedMemorySize;
}


void  *USB_malloc(INT wanted_size, INT boundary)
{
	USB_MHDR_T  *pPrimitivePos = _pCurrent;
	USB_MHDR_T  *pFound;
	INT   found_size=-1;
	INT   i, block_count;
	INT   wrap = 0;

	if (!_IsInUsbInterrupt)
		DISABLE_USB_INT();
	
	if (wanted_size >= _FreeMemorySize)
	{
		sysprintf("USB_malloc - want=%d, free=%d\n", wanted_size, _FreeMemorySize);
		if (!_IsInUsbInterrupt)
			ENABLE_USB_INT();
		return NULL;
	}
	
	if ((UINT32)_pCurrent >= _MemoryPoolEnd)
	   _pCurrent = (USB_MHDR_T *)_MemoryPoolBase;   /* wrapped */

	do 
	{
		if (_pCurrent->flag)          /* is not a free block */
		{
			if (_pCurrent->magic != USB_MEM_ALLOC_MAGIC)
			{
				sysprintf("\nUSB_malloc - incorrect magic number! C:%x F:%x, wanted:%d, Base:0x%x, End:0x%x\n", (UINT32)_pCurrent, _FreeMemorySize, wanted_size, (UINT32)_MemoryPoolBase, (UINT32)_MemoryPoolEnd);
				if (!_IsInUsbInterrupt)
					ENABLE_USB_INT();
				return NULL;
			}

			if (_pCurrent->flag == 0x3)
				_pCurrent = (USB_MHDR_T *)((UINT32)_pCurrent + _pCurrent->bcnt * USB_MEM_BLOCK_SIZE);
			else
			{
				sysprintf("USB_malloc warning - not the first block!\n");
				_pCurrent = (USB_MHDR_T *)((UINT32)_pCurrent + USB_MEM_BLOCK_SIZE);
			}
			
			if ((UINT32)_pCurrent > _MemoryPoolEnd)
				sysprintf("USB_malloc - behind limit!!\n");

			if ((UINT32)_pCurrent == _MemoryPoolEnd)
			{
				//sysprintf("USB_alloc - warp!!\n");
				wrap = 1;
				_pCurrent = (USB_MHDR_T *)_MemoryPoolBase;   /* wrapped */
			}
			
			found_size = -1;          /* reset the accumlator */
		}
		else                         /* is a free block */
		{
			if (found_size == -1)     /* the leading block */
			{
				pFound = _pCurrent;
				block_count = 1;
			   
				if (boundary > BOUNDARY_WORD)
					found_size = 0;    /* not use the data area of the leading block */
				else
					found_size = USB_MEM_BLOCK_SIZE - sizeof(USB_MHDR_T);
			   
				/* check boundary -
				 * If boundary > BOUNDARY_WORD, the start of next block should 
				 * be the beginning address of allocated memory. Thus, we check
				 * the boundary of the next block. The leading block will be
				 * used as a header only.
				 */
				if ((boundary > BOUNDARY_WORD) &&
					((((UINT32)_pCurrent)+USB_MEM_BLOCK_SIZE >= _MemoryPoolEnd) ||
					((((UINT32)_pCurrent)+USB_MEM_BLOCK_SIZE) % boundary != 0)))
					found_size = -1;   /* violate boundary, reset the accumlator */
			}
			else                      /* not the leading block */
			{
				found_size += USB_MEM_BLOCK_SIZE;
				block_count++;
			}
			   
			if (found_size >= wanted_size)
			{
				pFound->bcnt = block_count;
				pFound->magic = USB_MEM_ALLOC_MAGIC;
				_FreeMemorySize -= block_count * USB_MEM_BLOCK_SIZE;
				_AllocatedMemorySize += block_count * USB_MEM_BLOCK_SIZE;
				_pCurrent = pFound;
				for (i=0; i<block_count; i++)
				{
					_pCurrent->flag = 1;     /* allocate block */
					_pCurrent = (USB_MHDR_T *)((UINT32)_pCurrent + USB_MEM_BLOCK_SIZE);
				} 
				pFound->flag = 0x3;
				
				if (boundary > BOUNDARY_WORD)
				{
					if (!_IsInUsbInterrupt)
						ENABLE_USB_INT();
					//sysprintf("- 0x%x, %d\n", (int)pFound, wanted_size);
					return (void *)((UINT32)pFound + USB_MEM_BLOCK_SIZE);
				}
				else
				{
					//USB_debug("USB_malloc(%d,%d):%x\tsize:%d, C:0x%x, %d\n", wanted_size, boundary, (UINT32)pFound + sizeof(USB_MHDR_T), block_count * USB_MEM_BLOCK_SIZE, _pCurrent, block_count);
					if (!_IsInUsbInterrupt)
						ENABLE_USB_INT();
					//sysprintf("- 0x%x, %d\n", (int)pFound, wanted_size);
					return (void *)((UINT32)pFound + sizeof(USB_MHDR_T));
				}
			}
			 
			/* advance to the next block */
			_pCurrent = (USB_MHDR_T *)((UINT32)_pCurrent + USB_MEM_BLOCK_SIZE);
			if ((UINT32)_pCurrent >= _MemoryPoolEnd)
			{
				wrap = 1;
				_pCurrent = (USB_MHDR_T *)_MemoryPoolBase;   /* wrapped */
				found_size = -1;     /* reset accumlator */
			}
		}
	} while ((wrap == 0) || (_pCurrent < pPrimitivePos));
	   
	sysprintf("USB_malloc - No free memory!\n");
	if (!_IsInUsbInterrupt)
		ENABLE_USB_INT();
	return NULL;
}


void  USB_free(void *alloc_addr)
{
	USB_MHDR_T  *pMblk;
	UINT32  addr = (UINT32)alloc_addr;
	INT     i, count;
	
	//sysprintf("USB_free: 0x%x\n", (int)alloc_addr);

	if ((addr < _MemoryPoolBase) || (addr >= _MemoryPoolEnd))
	{
		if (addr)
			free(alloc_addr);
		return;
	}

	if (!_IsInUsbInterrupt)
		DISABLE_USB_INT();
	
	//sysprintf("USB_free:%x\n", (INT)addr+USB_MEM_BLOCK_SIZE);

	/* get the leading block address */
	if (addr % USB_MEM_BLOCK_SIZE == 0)
		addr -= USB_MEM_BLOCK_SIZE;
	else
		addr -= sizeof(USB_MHDR_T);
		
	if (addr % USB_MEM_BLOCK_SIZE != 0)
	{
		sysprintf("USB_free fatal error on address: %x!!\n", (UINT32)alloc_addr);
		if (!_IsInUsbInterrupt)
			ENABLE_USB_INT();
		return;
	}
	
	pMblk = (USB_MHDR_T *)addr;
	if (pMblk->flag == 0)
	{
		sysprintf("USB_free(), warning - try to free a free block: %x\n", (UINT32)alloc_addr);
		if (!_IsInUsbInterrupt)
			ENABLE_USB_INT();
		return;
	}
	if (pMblk->magic != USB_MEM_ALLOC_MAGIC)
	{
		sysprintf("USB_free(), warning - try to free an unknow block at address:%x.\n", addr);
		if (!_IsInUsbInterrupt)
			ENABLE_USB_INT();
		return;
	}

	//_pCurrent = pMblk;

	//sysprintf("+ 0x%x, %d\n", (int)pMblk, pMblk->bcnt);
	
	count = pMblk->bcnt;
	for (i = 0; i < count; i++)
	{
		pMblk->flag = 0;     /* release block */
		pMblk = (USB_MHDR_T *)((UINT32)pMblk + USB_MEM_BLOCK_SIZE);
	}

	_FreeMemorySize += count * USB_MEM_BLOCK_SIZE;
	_AllocatedMemorySize -= count * USB_MEM_BLOCK_SIZE;
	if (!_IsInUsbInterrupt)
		ENABLE_USB_INT();
	return;
}


/*-------------------------------------------------------------------------
 *  Logging System
 *-------------------------------------------------------------------------*/

#ifdef LOG_TO_MEMORY
#define UART_putchar(c) {  \
						_DriverLogPool[_DriverLogIndex] = c; \
						_DriverLogIndex = (_DriverLogIndex+1) % DRIVER_LOG_MEMORY_SIZE; \
						}
#endif
						

/*-------------------------------------------------------------------------
 *  Milisecond delay
 *-------------------------------------------------------------------------*/

void  USB_SetBit(INT nr, UINT8 *map)
{
	UINT8  *byte;
	
	byte = map + (nr / 8);
	*byte |= (0x80 >> (nr % 8));
}

void  USB_ClearBit(INT nr, UINT8 *map)
{
	UINT8   *byte;
	
	byte = map + (nr / 8);
	*byte &= ~(0x80 >> (nr % 8));
}

/// @endcond HIDDEN_SYMBOLS

